#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/stackhpc/bastion-vglab/runs/run-UgZER7A4AfByWoP9

Waiting for the plan to start...

Terraform v0.14.2
Configuring remote state backend...
Initializing Terraform configuration...
openstack_networking_port_v2.bastion: Refreshing state... [id=ec8dd7b6-8875-45ea-a0e0-16d4a06510fd]
openstack_compute_instance_v2.bastion: Refreshing state... [id=225828b0-aa9a-4be6-9d67-2ce3134e5b83]
null_resource.users["michal"]: Refreshing state... [id=3202130113663234150]
null_resource.users["piotr"]: Refreshing state... [id=1296687087217077756]
null_resource.users["matt"]: Refreshing state... [id=5634919716345701263]
null_resource.users["bartosz"]: Refreshing state... [id=2414744946779675953]
null_resource.users["bharat"]: Refreshing state... [id=2673758989189879716]
null_resource.users["mark"]: Refreshing state... [id=8409888894395321522]
null_resource.users["steveb"]: Refreshing state... [id=1228647608407664055]
openstack_compute_floatingip_associate_v2.bastion: Refreshing state... [id=185.45.78.150/225828b0-aa9a-4be6-9d67-2ce3134e5b83/]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # null_resource.users["bartosz"] must be replaced
-/+ resource "null_resource" "users" {
      ~ id       = "2414744946779675953" -> (known after apply)
      ~ triggers = {
          - "authorized_keys" = <<-EOT
                ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIM1iGZ6wblHvuShGuP3yzhoa5ME069yYE2jPFEOAPttC bartosz@stackhpc.com
            EOT
          - "host"            = "185.45.78.150"
          - "instance"        = "225828b0-aa9a-4be6-9d67-2ce3134e5b83"
          - "user"            = "ubuntu"
        } -> (known after apply) # forces replacement
    }

  # null_resource.users["bharat"] must be replaced
-/+ resource "null_resource" "users" {
      ~ id       = "2673758989189879716" -> (known after apply)
      ~ triggers = {
          - "authorized_keys" = <<-EOT
                ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIOzqpG9N2Zjnb45cYUgtm1R3PrTJZhB+cUcFbqoijzWn brtknr@MacBook
            EOT
          - "host"            = "185.45.78.150"
          - "instance"        = "225828b0-aa9a-4be6-9d67-2ce3134e5b83"
          - "user"            = "ubuntu"
        } -> (known after apply) # forces replacement
    }

  # null_resource.users["mark"] must be replaced
-/+ resource "null_resource" "users" {
      ~ id       = "8409888894395321522" -> (known after apply)
      ~ triggers = {
          - "authorized_keys" = <<-EOT
                ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIJXNGOmsnRcZdmjMA5f3fgq8l8+QMjBywJQzuvxlhslx mark@mark-xps15
            EOT
          - "host"            = "185.45.78.150"
          - "instance"        = "225828b0-aa9a-4be6-9d67-2ce3134e5b83"
          - "user"            = "ubuntu"
        } -> (known after apply) # forces replacement
    }

  # null_resource.users["matt"] must be replaced
-/+ resource "null_resource" "users" {
      ~ id       = "5634919716345701263" -> (known after apply)
      ~ triggers = {
          - "authorized_keys" = <<-EOT
                ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIJa0D+EVJkKo6NDnw23+W23tkKr4MPZQxn0+guCXKCT1 matt@stackhpc.com
            EOT
          - "host"            = "185.45.78.150"
          - "instance"        = "225828b0-aa9a-4be6-9d67-2ce3134e5b83"
          - "user"            = "ubuntu"
        } -> (known after apply) # forces replacement
    }

  # null_resource.users["michal"] must be replaced
-/+ resource "null_resource" "users" {
      ~ id       = "3202130113663234150" -> (known after apply)
      ~ triggers = {
          - "authorized_keys" = <<-EOT
                ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAICY4CwVM472QS5TYhEwAHge4vbkuBtpVUCC8cyIolYR5 michal@stackhpc.com
            EOT
          - "host"            = "185.45.78.150"
          - "instance"        = "225828b0-aa9a-4be6-9d67-2ce3134e5b83"
          - "user"            = "ubuntu"
        } -> (known after apply) # forces replacement
    }

  # null_resource.users["piotr"] must be replaced
-/+ resource "null_resource" "users" {
      ~ id       = "1296687087217077756" -> (known after apply)
      ~ triggers = {
          - "authorized_keys" = <<-EOT
                ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIHK1Kf1hRYskYfYtXnqnyzD6vFbpKVyUtcxcn2pYL2y+ piotr@stackhpc.com
            EOT
          - "host"            = "185.45.78.150"
          - "instance"        = "225828b0-aa9a-4be6-9d67-2ce3134e5b83"
          - "user"            = "ubuntu"
        } -> (known after apply) # forces replacement
    }

  # null_resource.users["steveb"] must be replaced
-/+ resource "null_resource" "users" {
      ~ id       = "1228647608407664055" -> (known after apply)
      ~ triggers = {
          - "authorized_keys" = <<-EOT
                ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDuNoaIV5Nw4HGblhFg6BOTpSlO+QZWxsZOtiaxR71CcP85+Sk8LQUY45L6gtO6n3swTLvkI96nTEQWjY7Cw2Z5WirO8Jctm0dYFtqU17jSkrgQymF7rHy/JCOVoIyLBlt/TJuTU5IRhw3Sd6HjAqvYstAV+8Bd1UWkzFQK/gUGx3SaqyWvKcINmSmszdS7+ZM/07Y9vXPW4MiJzWHQl1yqCEQ+QUttuYOxbNaHAwb9JOPgzsBnSFHW4skpCYKl4nsssE4um68Da7V0YFumwWXc/T6PBqwdMf2E2Ix/dFympzZGJA86mZFN6+NB2vvxKV7eY6BkKbbsinzQlCQT78AT steveb@DESKTOP-NSUK66K(base)
            EOT
          - "host"            = "185.45.78.150"
          - "instance"        = "225828b0-aa9a-4be6-9d67-2ce3134e5b83"
          - "user"            = "ubuntu"
        } -> (known after apply) # forces replacement
    }

  # openstack_compute_floatingip_associate_v2.bastion must be replaced
-/+ resource "openstack_compute_floatingip_associate_v2" "bastion" {
      ~ id          = "185.45.78.150/225828b0-aa9a-4be6-9d67-2ce3134e5b83/" -> (known after apply)
      ~ instance_id = "225828b0-aa9a-4be6-9d67-2ce3134e5b83" -> (known after apply) # forces replacement
      ~ region      = "RegionOne" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # openstack_compute_instance_v2.bastion must be replaced
-/+ resource "openstack_compute_instance_v2" "bastion" {
      ~ access_ip_v4        = "10.0.0.19" -> (known after apply)
      + access_ip_v6        = (known after apply)
      ~ all_metadata        = {} -> (known after apply)
      ~ all_tags            = [] -> (known after apply)
      ~ availability_zone   = "nova" -> (known after apply)
      ~ flavor_name         = "general.v1.tiny" -> (known after apply)
      ~ id                  = "225828b0-aa9a-4be6-9d67-2ce3134e5b83" -> (known after apply)
      ~ image_name          = "Ubuntu-20.04" -> (known after apply)
      ~ key_pair            = "bharat-mac" -> "vglab-bastion" # forces replacement
        name                = "vglab-bastion"
      ~ region              = "RegionOne" -> (known after apply)
      - tags                = [] -> null
        # (7 unchanged attributes hidden)

      ~ network {
          ~ fixed_ip_v4    = "10.0.0.19" -> (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          ~ mac            = "fa:16:3e:c2:74:8b" -> (known after apply)
          ~ name           = "ovn-network" -> (known after apply)
          ~ uuid           = "26023e3d-bc8e-459c-8def-dbd47ab01756" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # openstack_compute_keypair_v2.bastion will be created
  + resource "openstack_compute_keypair_v2" "bastion" {
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + name        = "vglab-bastion"
      + private_key = (known after apply)
      + public_key  = (known after apply)
      + region      = (known after apply)
    }

Plan: 10 to add, 0 to change, 9 to destroy.
```
</details>

#### Action: `pull_request` by @brtknr